Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/cpkcc.h
/*
 * Component description for CPKCC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_CPKCC_COMPONENT_H_
#define _PIC32CXMTC_CPKCC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CPKCC                                        */
/* ************************************************************************** */

/* -------- CPKCC_R : (CPKCC Offset: 0x00) (R/W 32) R Parameter Register -------- */
#define CPKCC_R_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_R) CPKCC_R value Position */
#define CPKCC_R_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_R_VALUE_Pos)          /* (CPKCC_R) CPKCC_R value Mask */
#define CPKCC_R_VALUE(value)                  (CPKCC_R_VALUE_Msk & (_UINT32_(value) << CPKCC_R_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_R register */
#define CPKCC_R_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_R) Register Mask  */


/* -------- CPKCC_X : (CPKCC Offset: 0x04) (R/W 32) X Parameter Register -------- */
#define CPKCC_X_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_X) CPKCC_X value Position */
#define CPKCC_X_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_X_VALUE_Pos)          /* (CPKCC_X) CPKCC_X value Mask */
#define CPKCC_X_VALUE(value)                  (CPKCC_X_VALUE_Msk & (_UINT32_(value) << CPKCC_X_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_X register */
#define CPKCC_X_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_X) Register Mask  */


/* -------- CPKCC_Y : (CPKCC Offset: 0x08) (R/W 32) Y Parameter Register -------- */
#define CPKCC_Y_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_Y) CPKCC_Y value Position */
#define CPKCC_Y_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_Y_VALUE_Pos)          /* (CPKCC_Y) CPKCC_Y value Mask */
#define CPKCC_Y_VALUE(value)                  (CPKCC_Y_VALUE_Msk & (_UINT32_(value) << CPKCC_Y_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_Y register */
#define CPKCC_Y_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_Y) Register Mask  */


/* -------- CPKCC_Z : (CPKCC Offset: 0x0C) (R/W 32) Z Parameter Register -------- */
#define CPKCC_Z_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_Z) CPKCC_Z value Position */
#define CPKCC_Z_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_Z_VALUE_Pos)          /* (CPKCC_Z) CPKCC_Z value Mask */
#define CPKCC_Z_VALUE(value)                  (CPKCC_Z_VALUE_Msk & (_UINT32_(value) << CPKCC_Z_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_Z register */
#define CPKCC_Z_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_Z) Register Mask  */


/* -------- CPKCC_J : (CPKCC Offset: 0x10) (R/W 32) J Parameter Register -------- */
#define CPKCC_J_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_J) CPKCC_J value Position */
#define CPKCC_J_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_J_VALUE_Pos)          /* (CPKCC_J) CPKCC_J value Mask */
#define CPKCC_J_VALUE(value)                  (CPKCC_J_VALUE_Msk & (_UINT32_(value) << CPKCC_J_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_J register */
#define CPKCC_J_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_J) Register Mask  */


/* -------- CPKCC_K : (CPKCC Offset: 0x14) (R/W 32) K Parameter Register -------- */
#define CPKCC_K_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_K) CPKCC_K value Position */
#define CPKCC_K_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_K_VALUE_Pos)          /* (CPKCC_K) CPKCC_K value Mask */
#define CPKCC_K_VALUE(value)                  (CPKCC_K_VALUE_Msk & (_UINT32_(value) << CPKCC_K_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_K register */
#define CPKCC_K_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_K) Register Mask  */


/* -------- CPKCC_N : (CPKCC Offset: 0x18) (R/W 32) N Parameter Register -------- */
#define CPKCC_N_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_N) CPKCC_N value Position */
#define CPKCC_N_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_N_VALUE_Pos)          /* (CPKCC_N) CPKCC_N value Mask */
#define CPKCC_N_VALUE(value)                  (CPKCC_N_VALUE_Msk & (_UINT32_(value) << CPKCC_N_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_N register */
#define CPKCC_N_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_N) Register Mask  */


/* -------- CPKCC_SMULA : (CPKCC Offset: 0x1C) (R/W 32) SMULA Register -------- */
#define CPKCC_SMULA_VALUE_Pos                 _UINT32_(0)                                          /* (CPKCC_SMULA) CPKCC_SMULA value Position */
#define CPKCC_SMULA_VALUE_Msk                 (_UINT32_(0xFFFFFFFF) << CPKCC_SMULA_VALUE_Pos)      /* (CPKCC_SMULA) CPKCC_SMULA value Mask */
#define CPKCC_SMULA_VALUE(value)              (CPKCC_SMULA_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULA_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULA register */
#define CPKCC_SMULA_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULA) Register Mask  */


/* -------- CPKCC_SMULB : (CPKCC Offset: 0x20) (R/W 32) SMULB Register -------- */
#define CPKCC_SMULB_VALUE_Pos                 _UINT32_(0)                                          /* (CPKCC_SMULB) CPKCC_SMULB value Position */
#define CPKCC_SMULB_VALUE_Msk                 (_UINT32_(0xFFFFFFFF) << CPKCC_SMULB_VALUE_Pos)      /* (CPKCC_SMULB) CPKCC_SMULB value Mask */
#define CPKCC_SMULB_VALUE(value)              (CPKCC_SMULB_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULB_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULB register */
#define CPKCC_SMULB_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULB) Register Mask  */


/* -------- CPKCC_SMULRL : (CPKCC Offset: 0x24) (R/W 32) SMULRL Register -------- */
#define CPKCC_SMULRL_VALUE_Pos                _UINT32_(0)                                          /* (CPKCC_SMULRL) CPKCC_SMULRL value Position */
#define CPKCC_SMULRL_VALUE_Msk                (_UINT32_(0xFFFFFFFF) << CPKCC_SMULRL_VALUE_Pos)     /* (CPKCC_SMULRL) CPKCC_SMULRL value Mask */
#define CPKCC_SMULRL_VALUE(value)             (CPKCC_SMULRL_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULRL_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULRL register */
#define CPKCC_SMULRL_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULRL) Register Mask  */


/* -------- CPKCC_SMULRH : (CPKCC Offset: 0x28) (R/W 32) SMULRH Register -------- */
#define CPKCC_SMULRH_VALUE_Pos                _UINT32_(0)                                          /* (CPKCC_SMULRH) CPKCC_SMULRH value Position */
#define CPKCC_SMULRH_VALUE_Msk                (_UINT32_(0xFFFFFFFF) << CPKCC_SMULRH_VALUE_Pos)     /* (CPKCC_SMULRH) CPKCC_SMULRH value Mask */
#define CPKCC_SMULRH_VALUE(value)             (CPKCC_SMULRH_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULRH_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULRH register */
#define CPKCC_SMULRH_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULRH) Register Mask  */


